text	SEGMENT		; визначає початок сегменту з назвою text
		ORG	100h	; початкове зміщення файла .COM на 256 = 100h байт
begin:	MOV	ax,20	; початок програми з назвою begin, копіювати число 20 в регістр ax
		MOV	bx,30	; копіювати число 30 в регістр bx
		ADD	ax,bx	; додати значення регістрів ax та bx, записати отримане значення в регістр ax
		MOV	cx,ax	; копіювати значення регістру ax в регістр сх
		ADD	ch,16	; додати число 16 та значення регістру ch, записати отримане значення в регістр ch
		RET			; повернення управління з процедури, до програми, що її викликала
text	ENDS		; завершує сегмент з назвою text, який починався з дерективи SEGMENT
		END	begin	; завершує програму